hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_rdc_regs.h
/*
 * IIR_EN (RW)
 *
 * IIR enable for adc input
 */
#define RDC_RDC_CTL_IIR_EN_MASK (0x100U)
#define RDC_RDC_CTL_IIR_EN_SHIFT (8U)
#define RDC_RDC_CTL_IIR_EN_SET(x) (((uint32_t)(x) << RDC_RDC_CTL_IIR_EN_SHIFT) & RDC_RDC_CTL_IIR_EN_MASK)
#define RDC_RDC_CTL_IIR_EN_GET(x) (((uint32_t)(x) & RDC_RDC_CTL_IIR_EN_MASK) >> RDC_RDC_CTL_IIR_EN_SHIFT)

/*
 * RECTIFY_SEL (RW)
 *
 * Select reference point of rectify signal
 * 0: 0 phase of internal exciting signal
 * 1: 90 phase of internal exciting signal
 * 2: 180 phase of internal exciting signal
 * 3: 270 phase of internal exciting signal
 * 4: use value on external pin
 * 5: use  invert value on external pin
 */
#define RDC_RDC_CTL_RECTIFY_SEL_MASK (0x70U)
#define RDC_RDC_CTL_RECTIFY_SEL_SHIFT (4U)
#define RDC_RDC_CTL_RECTIFY_SEL_SET(x) (((uint32_t)(x) << RDC_RDC_CTL_RECTIFY_SEL_SHIFT) & RDC_RDC_CTL_RECTIFY_SEL_MASK)
#define RDC_RDC_CTL_RECTIFY_SEL_GET(x) (((uint32_t)(x) & RDC_RDC_CTL_RECTIFY_SEL_MASK) >> RDC_RDC_CTL_RECTIFY_SEL_SHIFT)

/*
 * ACC_FAST (RW)
 *
 * every adc value can be  as one accumulate value
 */
#define RDC_RDC_CTL_ACC_FAST_MASK (0x8U)
#define RDC_RDC_CTL_ACC_FAST_SHIFT (3U)
#define RDC_RDC_CTL_ACC_FAST_SET(x) (((uint32_t)(x) << RDC_RDC_CTL_ACC_FAST_SHIFT) & RDC_RDC_CTL_ACC_FAST_MASK)
#define RDC_RDC_CTL_ACC_FAST_GET(x) (((uint32_t)(x) & RDC_RDC_CTL_ACC_FAST_MASK) >> RDC_RDC_CTL_ACC_FAST_SHIFT)

/*
 * ACC_EN (RW)
 *
 * Enable rdc accumulate
 * 0: rdc disable
 * 1: rdc enable
 */
#define RDC_RDC_CTL_ACC_EN_MASK (0x4U)
#define RDC_RDC_CTL_ACC_EN_SHIFT (2U)
#define RDC_RDC_CTL_ACC_EN_SET(x) (((uint32_t)(x) << RDC_RDC_CTL_ACC_EN_SHIFT) & RDC_RDC_CTL_ACC_EN_MASK)
#define RDC_RDC_CTL_ACC_EN_GET(x) (((uint32_t)(x) & RDC_RDC_CTL_ACC_EN_MASK) >> RDC_RDC_CTL_ACC_EN_SHIFT)

/*
 * EXC_START (RW1C)
 *
 * Write 1 start excite signal, always read 0
 * 0: no effect
 * 1: start excite signal
 */
#define RDC_RDC_CTL_EXC_START_MASK (0x2U)
#define RDC_RDC_CTL_EXC_START_SHIFT (1U)
#define RDC_RDC_CTL_EXC_START_SET(x) (((uint32_t)(x) << RDC_RDC_CTL_EXC_START_SHIFT) & RDC_RDC_CTL_EXC_START_MASK)
#define RDC_RDC_CTL_EXC_START_GET(x) (((uint32_t)(x) & RDC_RDC_CTL_EXC_START_MASK) >> RDC_RDC_CTL_EXC_START_SHIFT)

/*
 * EXC_EN (RW)
 *
 * Enable rdc excite signal
 * 0: rdc disable
 * 1: rdc enable
 */
#define RDC_RDC_CTL_EXC_EN_MASK (0x1U)
#define RDC_RDC_CTL_EXC_EN_SHIFT (0U)
#define RDC_RDC_CTL_EXC_EN_SET(x) (((uint32_t)(x) << RDC_RDC_CTL_EXC_EN_SHIFT) & RDC_RDC_CTL_EXC_EN_MASK)
#define RDC_RDC_CTL_EXC_EN_GET(x) (((uint32_t)(x) & RDC_RDC_CTL_EXC_EN_MASK) >> RDC_RDC_CTL_EXC_EN_SHIFT)

/* Bitfield definition for register: ACC_I */
/*
 * ACC (RO)
 *
 * accumulate result of i_channel, this is a signed number
 */
#define RDC_ACC_I_ACC_MASK (0xFFFFFFFFUL)
#define RDC_ACC_I_ACC_SHIFT (0U)
#define RDC_ACC_I_ACC_GET(x) (((uint32_t)(x) & RDC_ACC_I_ACC_MASK) >> RDC_ACC_I_ACC_SHIFT)

/* Bitfield definition for register: ACC_Q */
/*
 * ACC (RO)
 *
 * accumulate result of q_channel, this is a signed number
 */
#define RDC_ACC_Q_ACC_MASK (0xFFFFFFFFUL)
#define RDC_ACC_Q_ACC_SHIFT (0U)
#define RDC_ACC_Q_ACC_GET(x) (((uint32_t)(x) & RDC_ACC_Q_ACC_MASK) >> RDC_ACC_Q_ACC_SHIFT)

/* Bitfield definition for register: IN_CTL */
/*
 * PORT_Q_SEL (RW)
 *
 * Input port selection for q_channel,
 * 0:sel port0
 * 1:sel port1
 */
#define RDC_IN_CTL_PORT_Q_SEL_MASK (0x100000UL)
#define RDC_IN_CTL_PORT_Q_SEL_SHIFT (20U)
#define RDC_IN_CTL_PORT_Q_SEL_SET(x) (((uint32_t)(x) << RDC_IN_CTL_PORT_Q_SEL_SHIFT) & RDC_IN_CTL_PORT_Q_SEL_MASK)
#define RDC_IN_CTL_PORT_Q_SEL_GET(x) (((uint32_t)(x) & RDC_IN_CTL_PORT_Q_SEL_MASK) >> RDC_IN_CTL_PORT_Q_SEL_SHIFT)

/*
 * CH_Q_SEL (RW)
 *
 * Input channel selection for q_channel
 * 0: channel 0 selected
 * 1: channel 1 selected
 * …
 * 31: channel 31 selected
 */
#define RDC_IN_CTL_CH_Q_SEL_MASK (0x1F000UL)
#define RDC_IN_CTL_CH_Q_SEL_SHIFT (12U)
#define RDC_IN_CTL_CH_Q_SEL_SET(x) (((uint32_t)(x) << RDC_IN_CTL_CH_Q_SEL_SHIFT) & RDC_IN_CTL_CH_Q_SEL_MASK)
#define RDC_IN_CTL_CH_Q_SEL_GET(x) (((uint32_t)(x) & RDC_IN_CTL_CH_Q_SEL_MASK) >> RDC_IN_CTL_CH_Q_SEL_SHIFT)

/*
 * PORT_I_SEL (RW)
 *
 * Input port selection for i_channel,
 * 0:sel port0
 * 1:sel port1
 */
#define RDC_IN_CTL_PORT_I_SEL_MASK (0x100U)
#define RDC_IN_CTL_PORT_I_SEL_SHIFT (8U)
#define RDC_IN_CTL_PORT_I_SEL_SET(x) (((uint32_t)(x) << RDC_IN_CTL_PORT_I_SEL_SHIFT) & RDC_IN_CTL_PORT_I_SEL_MASK)
#define RDC_IN_CTL_PORT_I_SEL_GET(x) (((uint32_t)(x) & RDC_IN_CTL_PORT_I_SEL_MASK) >> RDC_IN_CTL_PORT_I_SEL_SHIFT)

/*
 * CH_I_SEL (RW)
 *
 * Input channel selection for i_channel
 * 0: channel 0 selected
 * 1: channel 1 selected
 * …
 * 31: channel 31 selected
 */
#define RDC_IN_CTL_CH_I_SEL_MASK (0x1FU)
#define RDC_IN_CTL_CH_I_SEL_SHIFT (0U)
#define RDC_IN_CTL_CH_I_SEL_SET(x) (((uint32_t)(x) << RDC_IN_CTL_CH_I_SEL_SHIFT) & RDC_IN_CTL_CH_I_SEL_MASK)
#define RDC_IN_CTL_CH_I_SEL_GET(x) (((uint32_t)(x) & RDC_IN_CTL_CH_I_SEL_MASK) >> RDC_IN_CTL_CH_I_SEL_SHIFT)

/* Bitfield definition for register: OUT_CTL */
/*
 * CH_Q_SEL (RW)
 *
 * Output channel selection for q_channel
 */
#define RDC_OUT_CTL_CH_Q_SEL_MASK (0x1F00U)
#define RDC_OUT_CTL_CH_Q_SEL_SHIFT (8U)
#define RDC_OUT_CTL_CH_Q_SEL_SET(x) (((uint32_t)(x) << RDC_OUT_CTL_CH_Q_SEL_SHIFT) & RDC_OUT_CTL_CH_Q_SEL_MASK)
#define RDC_OUT_CTL_CH_Q_SEL_GET(x) (((uint32_t)(x) & RDC_OUT_CTL_CH_Q_SEL_MASK) >> RDC_OUT_CTL_CH_Q_SEL_SHIFT)

/*
 * CH_I_SEL (RW)
 *
 * Output channel selection for i_channel
 */
#define RDC_OUT_CTL_CH_I_SEL_MASK (0x1FU)
#define RDC_OUT_CTL_CH_I_SEL_SHIFT (0U)
#define RDC_OUT_CTL_CH_I_SEL_SET(x) (((uint32_t)(x) << RDC_OUT_CTL_CH_I_SEL_SHIFT) & RDC_OUT_CTL_CH_I_SEL_MASK)
#define RDC_OUT_CTL_CH_I_SEL_GET(x) (((uint32_t)(x) & RDC_OUT_CTL_CH_I_SEL_MASK) >> RDC_OUT_CTL_CH_I_SEL_SHIFT)

/* Bitfield definition for register: IIR_B */
/*
 * LOWPASS (RW)
 *
 * IIR in lowpass mode
 */
#define RDC_IIR_B_LOWPASS_MASK (0x1000000UL)
#define RDC_IIR_B_LOWPASS_SHIFT (24U)
#define RDC_IIR_B_LOWPASS_SET(x) (((uint32_t)(x) << RDC_IIR_B_LOWPASS_SHIFT) & RDC_IIR_B_LOWPASS_MASK)
#define RDC_IIR_B_LOWPASS_GET(x) (((uint32_t)(x) & RDC_IIR_B_LOWPASS_MASK) >> RDC_IIR_B_LOWPASS_SHIFT)

