hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_rdc_regs.h
/*
 * IIR_B (RW)
 *
 * IIR parameter for b branch
 */
#define RDC_IIR_B_IIR_B_MASK (0x7U)
#define RDC_IIR_B_IIR_B_SHIFT (0U)
#define RDC_IIR_B_IIR_B_SET(x) (((uint32_t)(x) << RDC_IIR_B_IIR_B_SHIFT) & RDC_IIR_B_IIR_B_MASK)
#define RDC_IIR_B_IIR_B_GET(x) (((uint32_t)(x) & RDC_IIR_B_IIR_B_MASK) >> RDC_IIR_B_IIR_B_SHIFT)

/* Bitfield definition for register: IIR_A */
/*
 * IIR_A2 (RW)
 *
 * IIR parameter a2 for a branch
 */
#define RDC_IIR_A_IIR_A2_MASK (0xFF0000UL)
#define RDC_IIR_A_IIR_A2_SHIFT (16U)
#define RDC_IIR_A_IIR_A2_SET(x) (((uint32_t)(x) << RDC_IIR_A_IIR_A2_SHIFT) & RDC_IIR_A_IIR_A2_MASK)
#define RDC_IIR_A_IIR_A2_GET(x) (((uint32_t)(x) & RDC_IIR_A_IIR_A2_MASK) >> RDC_IIR_A_IIR_A2_SHIFT)

/*
 * IIR_A1 (RW)
 *
 * IIR parameter a1 for a branch
 */
#define RDC_IIR_A_IIR_A1_MASK (0x1FFU)
#define RDC_IIR_A_IIR_A1_SHIFT (0U)
#define RDC_IIR_A_IIR_A1_SET(x) (((uint32_t)(x) << RDC_IIR_A_IIR_A1_SHIFT) & RDC_IIR_A_IIR_A1_MASK)
#define RDC_IIR_A_IIR_A1_GET(x) (((uint32_t)(x) & RDC_IIR_A_IIR_A1_MASK) >> RDC_IIR_A_IIR_A1_SHIFT)

/* Bitfield definition for register: EXC_TIMMING */
/*
 * SWAP (RW)
 *
 * Swap output of PWM and DAC
 * 0: disable swap
 * 1: swap output
 */
#define RDC_EXC_TIMMING_SWAP_MASK (0x1000000UL)
#define RDC_EXC_TIMMING_SWAP_SHIFT (24U)
#define RDC_EXC_TIMMING_SWAP_SET(x) (((uint32_t)(x) << RDC_EXC_TIMMING_SWAP_SHIFT) & RDC_EXC_TIMMING_SWAP_MASK)
#define RDC_EXC_TIMMING_SWAP_GET(x) (((uint32_t)(x) & RDC_EXC_TIMMING_SWAP_MASK) >> RDC_EXC_TIMMING_SWAP_SHIFT)

/*
 * PWM_PRD (RW)
 *
 * Pwm period in samples，
 * 0：1 sample period
 * 1:   2 sample period
 * ...
 * 15: 16 sample period
 */
#define RDC_EXC_TIMMING_PWM_PRD_MASK (0xF00000UL)
#define RDC_EXC_TIMMING_PWM_PRD_SHIFT (20U)
#define RDC_EXC_TIMMING_PWM_PRD_SET(x) (((uint32_t)(x) << RDC_EXC_TIMMING_PWM_PRD_SHIFT) & RDC_EXC_TIMMING_PWM_PRD_MASK)
#define RDC_EXC_TIMMING_PWM_PRD_GET(x) (((uint32_t)(x) & RDC_EXC_TIMMING_PWM_PRD_MASK) >> RDC_EXC_TIMMING_PWM_PRD_SHIFT)

/*
 * SMP_NUM (RW)
 *
 * Number of sample every excitation period
 * 0: 4 point
 * 1: 8 point
 * …
 * 8: 1024 point
 */
#define RDC_EXC_TIMMING_SMP_NUM_MASK (0xF0000UL)
#define RDC_EXC_TIMMING_SMP_NUM_SHIFT (16U)
#define RDC_EXC_TIMMING_SMP_NUM_SET(x) (((uint32_t)(x) << RDC_EXC_TIMMING_SMP_NUM_SHIFT) & RDC_EXC_TIMMING_SMP_NUM_MASK)
#define RDC_EXC_TIMMING_SMP_NUM_GET(x) (((uint32_t)(x) & RDC_EXC_TIMMING_SMP_NUM_MASK) >> RDC_EXC_TIMMING_SMP_NUM_SHIFT)

/*
 * SMP_RATE (RW)
 *
 * The period for excitation sample in clock cycle，
 * 0: not allowed
 * 1: 1 cycle
 * 2: 2 cycles
 * …
 * 65535 : 65535 cycles
 */
#define RDC_EXC_TIMMING_SMP_RATE_MASK (0xFFFFU)
#define RDC_EXC_TIMMING_SMP_RATE_SHIFT (0U)
#define RDC_EXC_TIMMING_SMP_RATE_SET(x) (((uint32_t)(x) << RDC_EXC_TIMMING_SMP_RATE_SHIFT) & RDC_EXC_TIMMING_SMP_RATE_MASK)
#define RDC_EXC_TIMMING_SMP_RATE_GET(x) (((uint32_t)(x) & RDC_EXC_TIMMING_SMP_RATE_MASK) >> RDC_EXC_TIMMING_SMP_RATE_SHIFT)

/* Bitfield definition for register: EXC_SCALING */
/*
 * AMP_EXP (RW)
 *
 * Amplitude scaling for excitation,  amplitude = [table value] x man / 2^exp
 */
#define RDC_EXC_SCALING_AMP_EXP_MASK (0xF0U)
#define RDC_EXC_SCALING_AMP_EXP_SHIFT (4U)
#define RDC_EXC_SCALING_AMP_EXP_SET(x) (((uint32_t)(x) << RDC_EXC_SCALING_AMP_EXP_SHIFT) & RDC_EXC_SCALING_AMP_EXP_MASK)
#define RDC_EXC_SCALING_AMP_EXP_GET(x) (((uint32_t)(x) & RDC_EXC_SCALING_AMP_EXP_MASK) >> RDC_EXC_SCALING_AMP_EXP_SHIFT)

/*
 * AMP_MAN (RW)
 *
 * Amplitude scaling for excitation,  amplitude = [table value] x man / 2^exp
 */
#define RDC_EXC_SCALING_AMP_MAN_MASK (0xFU)
#define RDC_EXC_SCALING_AMP_MAN_SHIFT (0U)
#define RDC_EXC_SCALING_AMP_MAN_SET(x) (((uint32_t)(x) << RDC_EXC_SCALING_AMP_MAN_SHIFT) & RDC_EXC_SCALING_AMP_MAN_MASK)
#define RDC_EXC_SCALING_AMP_MAN_GET(x) (((uint32_t)(x) & RDC_EXC_SCALING_AMP_MAN_MASK) >> RDC_EXC_SCALING_AMP_MAN_SHIFT)

/* Bitfield definition for register: EXC_OFFSET */
/*
 * AMP_OFFSET (RW)
 *
 * Offset for excitation
 */
#define RDC_EXC_OFFSET_AMP_OFFSET_MASK (0xFFFFFFUL)
#define RDC_EXC_OFFSET_AMP_OFFSET_SHIFT (0U)
#define RDC_EXC_OFFSET_AMP_OFFSET_SET(x) (((uint32_t)(x) << RDC_EXC_OFFSET_AMP_OFFSET_SHIFT) & RDC_EXC_OFFSET_AMP_OFFSET_MASK)
#define RDC_EXC_OFFSET_AMP_OFFSET_GET(x) (((uint32_t)(x) & RDC_EXC_OFFSET_AMP_OFFSET_MASK) >> RDC_EXC_OFFSET_AMP_OFFSET_SHIFT)

/* Bitfield definition for register: PWM_SCALING */
/*
 * N_POL (RW)
 *
 * Polarity of exc_n signal
 * 0: high active
 * 1: low active
 */
#define RDC_PWM_SCALING_N_POL_MASK (0x2000U)
#define RDC_PWM_SCALING_N_POL_SHIFT (13U)
#define RDC_PWM_SCALING_N_POL_SET(x) (((uint32_t)(x) << RDC_PWM_SCALING_N_POL_SHIFT) & RDC_PWM_SCALING_N_POL_MASK)
#define RDC_PWM_SCALING_N_POL_GET(x) (((uint32_t)(x) & RDC_PWM_SCALING_N_POL_MASK) >> RDC_PWM_SCALING_N_POL_SHIFT)

/*
 * P_POL (RW)
 *
 * Polarity of exc_p signal
 * 0: high active
 * 1: low active
 */
#define RDC_PWM_SCALING_P_POL_MASK (0x1000U)
#define RDC_PWM_SCALING_P_POL_SHIFT (12U)
#define RDC_PWM_SCALING_P_POL_SET(x) (((uint32_t)(x) << RDC_PWM_SCALING_P_POL_SHIFT) & RDC_PWM_SCALING_P_POL_MASK)
#define RDC_PWM_SCALING_P_POL_GET(x) (((uint32_t)(x) & RDC_PWM_SCALING_P_POL_MASK) >> RDC_PWM_SCALING_P_POL_SHIFT)

/*
 * DITHER (RW)
 *
 * Enable dither of pwm
 * 0: disable
 * 1: enable
 */
#define RDC_PWM_SCALING_DITHER_MASK (0x100U)
#define RDC_PWM_SCALING_DITHER_SHIFT (8U)
#define RDC_PWM_SCALING_DITHER_SET(x) (((uint32_t)(x) << RDC_PWM_SCALING_DITHER_SHIFT) & RDC_PWM_SCALING_DITHER_MASK)
#define RDC_PWM_SCALING_DITHER_GET(x) (((uint32_t)(x) & RDC_PWM_SCALING_DITHER_MASK) >> RDC_PWM_SCALING_DITHER_SHIFT)

/*
 * AMP_EXP (RW)
 *
 * Amplitude scaling for excitation,  amplitude = [table value] x man / 2^exp
 */
#define RDC_PWM_SCALING_AMP_EXP_MASK (0xF0U)
#define RDC_PWM_SCALING_AMP_EXP_SHIFT (4U)
#define RDC_PWM_SCALING_AMP_EXP_SET(x) (((uint32_t)(x) << RDC_PWM_SCALING_AMP_EXP_SHIFT) & RDC_PWM_SCALING_AMP_EXP_MASK)
#define RDC_PWM_SCALING_AMP_EXP_GET(x) (((uint32_t)(x) & RDC_PWM_SCALING_AMP_EXP_MASK) >> RDC_PWM_SCALING_AMP_EXP_SHIFT)

/*
 * AMP_MAN (RW)
 *
 * Amplitude scaling for excitation,  amplitude = [table value] x man / 2^exp
 */
#define RDC_PWM_SCALING_AMP_MAN_MASK (0xFU)
#define RDC_PWM_SCALING_AMP_MAN_SHIFT (0U)
#define RDC_PWM_SCALING_AMP_MAN_SET(x) (((uint32_t)(x) << RDC_PWM_SCALING_AMP_MAN_SHIFT) & RDC_PWM_SCALING_AMP_MAN_MASK)
#define RDC_PWM_SCALING_AMP_MAN_GET(x) (((uint32_t)(x) & RDC_PWM_SCALING_AMP_MAN_MASK) >> RDC_PWM_SCALING_AMP_MAN_SHIFT)

