hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_rdc_regs.h
/* Bitfield definition for register: PWM_OFFSET */
/*
 * AMP_OFFSET (RW)
 *
 * Offset for excitation
 */
#define RDC_PWM_OFFSET_AMP_OFFSET_MASK (0xFFFFFFUL)
#define RDC_PWM_OFFSET_AMP_OFFSET_SHIFT (0U)
#define RDC_PWM_OFFSET_AMP_OFFSET_SET(x) (((uint32_t)(x) << RDC_PWM_OFFSET_AMP_OFFSET_SHIFT) & RDC_PWM_OFFSET_AMP_OFFSET_MASK)
#define RDC_PWM_OFFSET_AMP_OFFSET_GET(x) (((uint32_t)(x) & RDC_PWM_OFFSET_AMP_OFFSET_MASK) >> RDC_PWM_OFFSET_AMP_OFFSET_SHIFT)

/* Bitfield definition for register: TRIG_OUT0_CFG */
/*
 * ENABLE (RW)
 *
 * Enable trigger out0
 * 0: disable
 * 1: enable
 */
#define RDC_TRIG_OUT0_CFG_ENABLE_MASK (0x100000UL)
#define RDC_TRIG_OUT0_CFG_ENABLE_SHIFT (20U)
#define RDC_TRIG_OUT0_CFG_ENABLE_SET(x) (((uint32_t)(x) << RDC_TRIG_OUT0_CFG_ENABLE_SHIFT) & RDC_TRIG_OUT0_CFG_ENABLE_MASK)
#define RDC_TRIG_OUT0_CFG_ENABLE_GET(x) (((uint32_t)(x) & RDC_TRIG_OUT0_CFG_ENABLE_MASK) >> RDC_TRIG_OUT0_CFG_ENABLE_SHIFT)

/*
 * LEAD_TIM (RW)
 *
 * Lead time for trigger out0 from center of low level , this is a signed value
 * …
 * 2: 2 cycle befor center of low level
 * 1: 1 cycle before center of low level
 * 0: center of low level
 * -1: 1cycle after center of low level
 * -2: 2cycle after center of low level
 */
#define RDC_TRIG_OUT0_CFG_LEAD_TIM_MASK (0xFFFFFUL)
#define RDC_TRIG_OUT0_CFG_LEAD_TIM_SHIFT (0U)
#define RDC_TRIG_OUT0_CFG_LEAD_TIM_SET(x) (((uint32_t)(x) << RDC_TRIG_OUT0_CFG_LEAD_TIM_SHIFT) & RDC_TRIG_OUT0_CFG_LEAD_TIM_MASK)
#define RDC_TRIG_OUT0_CFG_LEAD_TIM_GET(x) (((uint32_t)(x) & RDC_TRIG_OUT0_CFG_LEAD_TIM_MASK) >> RDC_TRIG_OUT0_CFG_LEAD_TIM_SHIFT)

/* Bitfield definition for register: TRIG_OUT1_CFG */
/*
 * ENABLE (RW)
 *
 * Enable trigger out1
 * 0: disable
 * 1: enable
 */
#define RDC_TRIG_OUT1_CFG_ENABLE_MASK (0x100000UL)
#define RDC_TRIG_OUT1_CFG_ENABLE_SHIFT (20U)
#define RDC_TRIG_OUT1_CFG_ENABLE_SET(x) (((uint32_t)(x) << RDC_TRIG_OUT1_CFG_ENABLE_SHIFT) & RDC_TRIG_OUT1_CFG_ENABLE_MASK)
#define RDC_TRIG_OUT1_CFG_ENABLE_GET(x) (((uint32_t)(x) & RDC_TRIG_OUT1_CFG_ENABLE_MASK) >> RDC_TRIG_OUT1_CFG_ENABLE_SHIFT)

/*
 * LEAD_TIM (RW)
 *
 * Lead time for trigger out0 from center of hight level , this is a signed value
 * …
 * 2: 2 cycle befor center of hight level
 * 1: 1 cycle before center of hight level
 * 0: center of hight level
 * -1: 1cycle after center of hight level
 * -2: 2cycle after center of hight level
 */
#define RDC_TRIG_OUT1_CFG_LEAD_TIM_MASK (0xFFFFFUL)
#define RDC_TRIG_OUT1_CFG_LEAD_TIM_SHIFT (0U)
#define RDC_TRIG_OUT1_CFG_LEAD_TIM_SET(x) (((uint32_t)(x) << RDC_TRIG_OUT1_CFG_LEAD_TIM_SHIFT) & RDC_TRIG_OUT1_CFG_LEAD_TIM_MASK)
#define RDC_TRIG_OUT1_CFG_LEAD_TIM_GET(x) (((uint32_t)(x) & RDC_TRIG_OUT1_CFG_LEAD_TIM_MASK) >> RDC_TRIG_OUT1_CFG_LEAD_TIM_SHIFT)

/* Bitfield definition for register: PWM_DZ */
/*
 * DZ_N (RW)
 *
 * Exc_n dead zone  in clock cycle before swap
 * 0: no dead zone
 * 1: 1 cycle dead zone
 * 2: 2 cycle dead zone
 * …
 */
#define RDC_PWM_DZ_DZ_N_MASK (0xFF00U)
#define RDC_PWM_DZ_DZ_N_SHIFT (8U)
#define RDC_PWM_DZ_DZ_N_SET(x) (((uint32_t)(x) << RDC_PWM_DZ_DZ_N_SHIFT) & RDC_PWM_DZ_DZ_N_MASK)
#define RDC_PWM_DZ_DZ_N_GET(x) (((uint32_t)(x) & RDC_PWM_DZ_DZ_N_MASK) >> RDC_PWM_DZ_DZ_N_SHIFT)

/*
 * DZ_P (RW)
 *
 * Exc_p dead zone  in clock cycle before swap
 * 0: no dead zone
 * 1: 1 cycle dead zone
 * 2: 2 cycle dead zone
 * …
 */
#define RDC_PWM_DZ_DZ_P_MASK (0xFFU)
#define RDC_PWM_DZ_DZ_P_SHIFT (0U)
#define RDC_PWM_DZ_DZ_P_SET(x) (((uint32_t)(x) << RDC_PWM_DZ_DZ_P_SHIFT) & RDC_PWM_DZ_DZ_P_MASK)
#define RDC_PWM_DZ_DZ_P_GET(x) (((uint32_t)(x) & RDC_PWM_DZ_DZ_P_MASK) >> RDC_PWM_DZ_DZ_P_SHIFT)

/* Bitfield definition for register: SYNC_OUT_CTRL */
/*
 * PWM_OUT_DLY (RO)
 *
 * Delay bettween the delyed trigger and the first pwm pulse in clock cycle
 * 1: 1 cycle
 * 2: 2 cycle
 * …
 */
#define RDC_SYNC_OUT_CTRL_PWM_OUT_DLY_MASK (0xFFFF0000UL)
#define RDC_SYNC_OUT_CTRL_PWM_OUT_DLY_SHIFT (16U)
#define RDC_SYNC_OUT_CTRL_PWM_OUT_DLY_GET(x) (((uint32_t)(x) & RDC_SYNC_OUT_CTRL_PWM_OUT_DLY_MASK) >> RDC_SYNC_OUT_CTRL_PWM_OUT_DLY_SHIFT)

/*
 * MIN2TRIG_EN (RW)
 *
 * Enable trigger out from the min point of exciting signal
 * 1: enable
 * 0: disable
 */
#define RDC_SYNC_OUT_CTRL_MIN2TRIG_EN_MASK (0x20U)
#define RDC_SYNC_OUT_CTRL_MIN2TRIG_EN_SHIFT (5U)
#define RDC_SYNC_OUT_CTRL_MIN2TRIG_EN_SET(x) (((uint32_t)(x) << RDC_SYNC_OUT_CTRL_MIN2TRIG_EN_SHIFT) & RDC_SYNC_OUT_CTRL_MIN2TRIG_EN_MASK)
#define RDC_SYNC_OUT_CTRL_MIN2TRIG_EN_GET(x) (((uint32_t)(x) & RDC_SYNC_OUT_CTRL_MIN2TRIG_EN_MASK) >> RDC_SYNC_OUT_CTRL_MIN2TRIG_EN_SHIFT)

/*
 * MAX2TRIG_EN (RW)
 *
 * Enable trigger out from the max point of exciting signal
 * 1: enable
 * 0: disable
 */
#define RDC_SYNC_OUT_CTRL_MAX2TRIG_EN_MASK (0x10U)
#define RDC_SYNC_OUT_CTRL_MAX2TRIG_EN_SHIFT (4U)
#define RDC_SYNC_OUT_CTRL_MAX2TRIG_EN_SET(x) (((uint32_t)(x) << RDC_SYNC_OUT_CTRL_MAX2TRIG_EN_SHIFT) & RDC_SYNC_OUT_CTRL_MAX2TRIG_EN_MASK)
#define RDC_SYNC_OUT_CTRL_MAX2TRIG_EN_GET(x) (((uint32_t)(x) & RDC_SYNC_OUT_CTRL_MAX2TRIG_EN_MASK) >> RDC_SYNC_OUT_CTRL_MAX2TRIG_EN_SHIFT)

/*
 * SYNC_OUT_SEL (RW)
 *
 * Select output synchornize signal
 * 0: 0 phase of internal exciting signal
 * 1: 90 phase of internal exciting signal
 * 2: 180 phase of internal exciting signal
 * 3: 270 phase of internal exciting signal
 */
#define RDC_SYNC_OUT_CTRL_SYNC_OUT_SEL_MASK (0x3U)
#define RDC_SYNC_OUT_CTRL_SYNC_OUT_SEL_SHIFT (0U)
#define RDC_SYNC_OUT_CTRL_SYNC_OUT_SEL_SET(x) (((uint32_t)(x) << RDC_SYNC_OUT_CTRL_SYNC_OUT_SEL_SHIFT) & RDC_SYNC_OUT_CTRL_SYNC_OUT_SEL_MASK)
#define RDC_SYNC_OUT_CTRL_SYNC_OUT_SEL_GET(x) (((uint32_t)(x) & RDC_SYNC_OUT_CTRL_SYNC_OUT_SEL_MASK) >> RDC_SYNC_OUT_CTRL_SYNC_OUT_SEL_SHIFT)

/* Bitfield definition for register: EXC_SYNC_DLY */
/*
 * DISABLE (RW)
 *
 * Disable hardware trigger input
 * 0: enable
 * 1: disable
 */
#define RDC_EXC_SYNC_DLY_DISABLE_MASK (0x1000000UL)
#define RDC_EXC_SYNC_DLY_DISABLE_SHIFT (24U)
#define RDC_EXC_SYNC_DLY_DISABLE_SET(x) (((uint32_t)(x) << RDC_EXC_SYNC_DLY_DISABLE_SHIFT) & RDC_EXC_SYNC_DLY_DISABLE_MASK)
#define RDC_EXC_SYNC_DLY_DISABLE_GET(x) (((uint32_t)(x) & RDC_EXC_SYNC_DLY_DISABLE_MASK) >> RDC_EXC_SYNC_DLY_DISABLE_SHIFT)

