hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_rdc_regs.h
/*
 * DELAY (RW)
 *
 * Trigger in delay timming in bus cycle from rising edge of trigger signal
 * 0:   1 cycle
 * 1:  2 cycle
 * …
 * 0xffffff:  2^24 cycle
 */
#define RDC_EXC_SYNC_DLY_DELAY_MASK (0xFFFFFFUL)
#define RDC_EXC_SYNC_DLY_DELAY_SHIFT (0U)
#define RDC_EXC_SYNC_DLY_DELAY_SET(x) (((uint32_t)(x) << RDC_EXC_SYNC_DLY_DELAY_SHIFT) & RDC_EXC_SYNC_DLY_DELAY_MASK)
#define RDC_EXC_SYNC_DLY_DELAY_GET(x) (((uint32_t)(x) & RDC_EXC_SYNC_DLY_DELAY_MASK) >> RDC_EXC_SYNC_DLY_DELAY_SHIFT)

/* Bitfield definition for register: MAX_MIN_POS */
/*
 * MAX_MIN_POS (RW)
 *
 * max min value position
 * 0: max min value at adc input
 * 1: max min value at IIR output
 */
#define RDC_MAX_MIN_POS_MAX_MIN_POS_MASK (0x1U)
#define RDC_MAX_MIN_POS_MAX_MIN_POS_SHIFT (0U)
#define RDC_MAX_MIN_POS_MAX_MIN_POS_SET(x) (((uint32_t)(x) << RDC_MAX_MIN_POS_MAX_MIN_POS_SHIFT) & RDC_MAX_MIN_POS_MAX_MIN_POS_MASK)
#define RDC_MAX_MIN_POS_MAX_MIN_POS_GET(x) (((uint32_t)(x) & RDC_MAX_MIN_POS_MAX_MIN_POS_MASK) >> RDC_MAX_MIN_POS_MAX_MIN_POS_SHIFT)

/* Bitfield definition for register: MAX_I */
/*
 * MAX (RWC)
 *
 * Max value of  i_channel, write clear
 */
#define RDC_MAX_I_MAX_MASK (0xFFFFFF00UL)
#define RDC_MAX_I_MAX_SHIFT (8U)
#define RDC_MAX_I_MAX_SET(x) (((uint32_t)(x) << RDC_MAX_I_MAX_SHIFT) & RDC_MAX_I_MAX_MASK)
#define RDC_MAX_I_MAX_GET(x) (((uint32_t)(x) & RDC_MAX_I_MAX_MASK) >> RDC_MAX_I_MAX_SHIFT)

/*
 * VALID (RWC)
 *
 * Max value valid, write clear
 * 0: max value is not valid
 * 1: max value is valid
 */
#define RDC_MAX_I_VALID_MASK (0x1U)
#define RDC_MAX_I_VALID_SHIFT (0U)
#define RDC_MAX_I_VALID_SET(x) (((uint32_t)(x) << RDC_MAX_I_VALID_SHIFT) & RDC_MAX_I_VALID_MASK)
#define RDC_MAX_I_VALID_GET(x) (((uint32_t)(x) & RDC_MAX_I_VALID_MASK) >> RDC_MAX_I_VALID_SHIFT)

/* Bitfield definition for register: MIN_I */
/*
 * MIN (RWC)
 *
 * Min value of  i_channel, write clear
 */
#define RDC_MIN_I_MIN_MASK (0xFFFFFF00UL)
#define RDC_MIN_I_MIN_SHIFT (8U)
#define RDC_MIN_I_MIN_SET(x) (((uint32_t)(x) << RDC_MIN_I_MIN_SHIFT) & RDC_MIN_I_MIN_MASK)
#define RDC_MIN_I_MIN_GET(x) (((uint32_t)(x) & RDC_MIN_I_MIN_MASK) >> RDC_MIN_I_MIN_SHIFT)

/*
 * VALID (RWC)
 *
 * Min value valid, write clear
 * 0: min value is not valid
 * 1: min value is valid
 */
#define RDC_MIN_I_VALID_MASK (0x1U)
#define RDC_MIN_I_VALID_SHIFT (0U)
#define RDC_MIN_I_VALID_SET(x) (((uint32_t)(x) << RDC_MIN_I_VALID_SHIFT) & RDC_MIN_I_VALID_MASK)
#define RDC_MIN_I_VALID_GET(x) (((uint32_t)(x) & RDC_MIN_I_VALID_MASK) >> RDC_MIN_I_VALID_SHIFT)

/* Bitfield definition for register: MAX_Q */
/*
 * MAX (RWC)
 *
 * Max value of  q_channel, write clear
 */
#define RDC_MAX_Q_MAX_MASK (0xFFFFFF00UL)
#define RDC_MAX_Q_MAX_SHIFT (8U)
#define RDC_MAX_Q_MAX_SET(x) (((uint32_t)(x) << RDC_MAX_Q_MAX_SHIFT) & RDC_MAX_Q_MAX_MASK)
#define RDC_MAX_Q_MAX_GET(x) (((uint32_t)(x) & RDC_MAX_Q_MAX_MASK) >> RDC_MAX_Q_MAX_SHIFT)

/*
 * VALID (RWC)
 *
 * Max value valid, write clear
 * 0: max value is not valid
 * 1: max value is valid
 */
#define RDC_MAX_Q_VALID_MASK (0x1U)
#define RDC_MAX_Q_VALID_SHIFT (0U)
#define RDC_MAX_Q_VALID_SET(x) (((uint32_t)(x) << RDC_MAX_Q_VALID_SHIFT) & RDC_MAX_Q_VALID_MASK)
#define RDC_MAX_Q_VALID_GET(x) (((uint32_t)(x) & RDC_MAX_Q_VALID_MASK) >> RDC_MAX_Q_VALID_SHIFT)

/* Bitfield definition for register: MIN_Q */
/*
 * MIN (RWC)
 *
 * Min value of  q_channel, write clear
 */
#define RDC_MIN_Q_MIN_MASK (0xFFFFFF00UL)
#define RDC_MIN_Q_MIN_SHIFT (8U)
#define RDC_MIN_Q_MIN_SET(x) (((uint32_t)(x) << RDC_MIN_Q_MIN_SHIFT) & RDC_MIN_Q_MIN_MASK)
#define RDC_MIN_Q_MIN_GET(x) (((uint32_t)(x) & RDC_MIN_Q_MIN_MASK) >> RDC_MIN_Q_MIN_SHIFT)

/*
 * VALID (RWC)
 *
 * Min value valid, write clear
 * 0: min value is not valid
 * 1: min value is valid
 */
#define RDC_MIN_Q_VALID_MASK (0x1U)
#define RDC_MIN_Q_VALID_SHIFT (0U)
#define RDC_MIN_Q_VALID_SET(x) (((uint32_t)(x) << RDC_MIN_Q_VALID_SHIFT) & RDC_MIN_Q_VALID_MASK)
#define RDC_MIN_Q_VALID_GET(x) (((uint32_t)(x) & RDC_MIN_Q_VALID_MASK) >> RDC_MIN_Q_VALID_SHIFT)

/* Bitfield definition for register: THRS_I */
/*
 * THRS (RW)
 *
 * The offset setting for edge detection of the i_channel, signed number
 * …
 * 2: the offset is 0x800000+2
 * 1: the offset is 0x800000+1
 * 0: the offset is 0x800000
 * -1: the offset is 0x800000-1
 * -2: the offset is 0x800000-2
 * …
 */
#define RDC_THRS_I_THRS_MASK (0xFFFFFF00UL)
#define RDC_THRS_I_THRS_SHIFT (8U)
#define RDC_THRS_I_THRS_SET(x) (((uint32_t)(x) << RDC_THRS_I_THRS_SHIFT) & RDC_THRS_I_THRS_MASK)
#define RDC_THRS_I_THRS_GET(x) (((uint32_t)(x) & RDC_THRS_I_THRS_MASK) >> RDC_THRS_I_THRS_SHIFT)

/*
 * THRS4ACC (RW)
 *
 * enable thrs data for accumulate
 */
#define RDC_THRS_I_THRS4ACC_MASK (0x1U)
#define RDC_THRS_I_THRS4ACC_SHIFT (0U)
#define RDC_THRS_I_THRS4ACC_SET(x) (((uint32_t)(x) << RDC_THRS_I_THRS4ACC_SHIFT) & RDC_THRS_I_THRS4ACC_MASK)
#define RDC_THRS_I_THRS4ACC_GET(x) (((uint32_t)(x) & RDC_THRS_I_THRS4ACC_MASK) >> RDC_THRS_I_THRS4ACC_SHIFT)

/* Bitfield definition for register: THRS_Q */
/*
 * THRS (RW)
 *
 * The offset setting for edge detection of the q_channel, signed number
 * …
 * 2: the offset is 0x800000+2
 * 1: the offset is 0x800000+1
 * 0: the offset is 0x800000
 * -1: the offset is 0x800000-1
 * -2: the offset is 0x800000-2
 * …
 */
#define RDC_THRS_Q_THRS_MASK (0xFFFFFF00UL)
#define RDC_THRS_Q_THRS_SHIFT (8U)
#define RDC_THRS_Q_THRS_SET(x) (((uint32_t)(x) << RDC_THRS_Q_THRS_SHIFT) & RDC_THRS_Q_THRS_MASK)
#define RDC_THRS_Q_THRS_GET(x) (((uint32_t)(x) & RDC_THRS_Q_THRS_MASK) >> RDC_THRS_Q_THRS_SHIFT)

/*
 * THRS4ACC (RW)
 *
 * enable thrs data for accumulate
 */
#define RDC_THRS_Q_THRS4ACC_MASK (0x1U)
#define RDC_THRS_Q_THRS4ACC_SHIFT (0U)
#define RDC_THRS_Q_THRS4ACC_SET(x) (((uint32_t)(x) << RDC_THRS_Q_THRS4ACC_SHIFT) & RDC_THRS_Q_THRS4ACC_MASK)
#define RDC_THRS_Q_THRS4ACC_GET(x) (((uint32_t)(x) & RDC_THRS_Q_THRS4ACC_MASK) >> RDC_THRS_Q_THRS4ACC_SHIFT)

/* Bitfield definition for register: EDG_DET_CTL */
/*
 * HOLD (RW)
 *
 * The minimum edge distance  in sample
 * 0:1 sample
 * 1:2 sample
 * 2:3 samples
 * …
 * 63:64 samples
 */
#define RDC_EDG_DET_CTL_HOLD_MASK (0x3F0U)
#define RDC_EDG_DET_CTL_HOLD_SHIFT (4U)
#define RDC_EDG_DET_CTL_HOLD_SET(x) (((uint32_t)(x) << RDC_EDG_DET_CTL_HOLD_SHIFT) & RDC_EDG_DET_CTL_HOLD_MASK)
#define RDC_EDG_DET_CTL_HOLD_GET(x) (((uint32_t)(x) & RDC_EDG_DET_CTL_HOLD_MASK) >> RDC_EDG_DET_CTL_HOLD_SHIFT)

