hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_rdc_regs.h
/*
 * FILTER (RW)
 *
 * The continuous positive or negative number for edge detection
 * 0: 1
 * 1: 2
 * …
 * 7: 8
 */
#define RDC_EDG_DET_CTL_FILTER_MASK (0x7U)
#define RDC_EDG_DET_CTL_FILTER_SHIFT (0U)
#define RDC_EDG_DET_CTL_FILTER_SET(x) (((uint32_t)(x) << RDC_EDG_DET_CTL_FILTER_SHIFT) & RDC_EDG_DET_CTL_FILTER_MASK)
#define RDC_EDG_DET_CTL_FILTER_GET(x) (((uint32_t)(x) & RDC_EDG_DET_CTL_FILTER_MASK) >> RDC_EDG_DET_CTL_FILTER_SHIFT)

/* Bitfield definition for register: ACC_SCALING */
/*
 * TOXIC_LK (RW)
 *
 * Toxic accumulation data be removed control
 * 1: enable
 * 0: disable
 */
#define RDC_ACC_SCALING_TOXIC_LK_MASK (0x100U)
#define RDC_ACC_SCALING_TOXIC_LK_SHIFT (8U)
#define RDC_ACC_SCALING_TOXIC_LK_SET(x) (((uint32_t)(x) << RDC_ACC_SCALING_TOXIC_LK_SHIFT) & RDC_ACC_SCALING_TOXIC_LK_MASK)
#define RDC_ACC_SCALING_TOXIC_LK_GET(x) (((uint32_t)(x) & RDC_ACC_SCALING_TOXIC_LK_MASK) >> RDC_ACC_SCALING_TOXIC_LK_SHIFT)

/*
 * ACC_SHIFT (RW)
 *
 * Accumulation value shift control, this is a sign number.
 * 0: {acc[39],acc[38:8]}
 * 1: {acc[39],acc[37:7]}
 * 2: {acc[39],acc[36:6]}
 * …
 * 7: {acc[39],acc[31:1]}
 * 8: {acc[39],acc[30:0]}
 * 9: acc/2^9
 * 10: acc/2^10
 * …
 * 15:acc/2^15
 */
#define RDC_ACC_SCALING_ACC_SHIFT_MASK (0xFU)
#define RDC_ACC_SCALING_ACC_SHIFT_SHIFT (0U)
#define RDC_ACC_SCALING_ACC_SHIFT_SET(x) (((uint32_t)(x) << RDC_ACC_SCALING_ACC_SHIFT_SHIFT) & RDC_ACC_SCALING_ACC_SHIFT_MASK)
#define RDC_ACC_SCALING_ACC_SHIFT_GET(x) (((uint32_t)(x) & RDC_ACC_SCALING_ACC_SHIFT_MASK) >> RDC_ACC_SCALING_ACC_SHIFT_SHIFT)

/* Bitfield definition for register: EXC_PERIOD */
/*
 * EXC_PERIOD (RW)
 *
 * The num in clock cycle for period of excitation
 * 0: invalid value
 * 1:1 cycle
 * 2:2 cycles
 * …
 */
#define RDC_EXC_PERIOD_EXC_PERIOD_MASK (0xFFFFFFFFUL)
#define RDC_EXC_PERIOD_EXC_PERIOD_SHIFT (0U)
#define RDC_EXC_PERIOD_EXC_PERIOD_SET(x) (((uint32_t)(x) << RDC_EXC_PERIOD_EXC_PERIOD_SHIFT) & RDC_EXC_PERIOD_EXC_PERIOD_MASK)
#define RDC_EXC_PERIOD_EXC_PERIOD_GET(x) (((uint32_t)(x) & RDC_EXC_PERIOD_EXC_PERIOD_MASK) >> RDC_EXC_PERIOD_EXC_PERIOD_SHIFT)

/* Bitfield definition for register: SYNC_DELAY_I */
/*
 * DELAY (RW)
 *
 * Delay  in clock cycle for synchronous signal, the value shoud less than half of exc_period.exc_period.
 * 0: invalid value
 * 1: 1 cycles
 * 2: 2 cycles
 * ...
 */
#define RDC_SYNC_DELAY_I_DELAY_MASK (0xFFFFFFFFUL)
#define RDC_SYNC_DELAY_I_DELAY_SHIFT (0U)
#define RDC_SYNC_DELAY_I_DELAY_SET(x) (((uint32_t)(x) << RDC_SYNC_DELAY_I_DELAY_SHIFT) & RDC_SYNC_DELAY_I_DELAY_MASK)
#define RDC_SYNC_DELAY_I_DELAY_GET(x) (((uint32_t)(x) & RDC_SYNC_DELAY_I_DELAY_MASK) >> RDC_SYNC_DELAY_I_DELAY_SHIFT)

/* Bitfield definition for register: RISE_DELAY_I */
/*
 * RISE_DELAY (RO)
 *
 * Delay value on rising edge of  i_channel data
 * 0: 1 cycle
 * 1: 2 cycles
 * …
 */
#define RDC_RISE_DELAY_I_RISE_DELAY_MASK (0xFFFFFFFFUL)
#define RDC_RISE_DELAY_I_RISE_DELAY_SHIFT (0U)
#define RDC_RISE_DELAY_I_RISE_DELAY_GET(x) (((uint32_t)(x) & RDC_RISE_DELAY_I_RISE_DELAY_MASK) >> RDC_RISE_DELAY_I_RISE_DELAY_SHIFT)

/* Bitfield definition for register: FALL_DELAY_I */
/*
 * FALL_DELAY (RO)
 *
 * Delay value on falling edge of  i_channel data
 * 0: 1 cycle
 * 1: 2 cycles
 * …
 */
#define RDC_FALL_DELAY_I_FALL_DELAY_MASK (0xFFFFFFFFUL)
#define RDC_FALL_DELAY_I_FALL_DELAY_SHIFT (0U)
#define RDC_FALL_DELAY_I_FALL_DELAY_GET(x) (((uint32_t)(x) & RDC_FALL_DELAY_I_FALL_DELAY_MASK) >> RDC_FALL_DELAY_I_FALL_DELAY_SHIFT)

/* Bitfield definition for register: SAMPLE_RISE_I */
/*
 * VALUE (RO)
 *
 * sample value on rising edge of rectify signal
 */
#define RDC_SAMPLE_RISE_I_VALUE_MASK (0xFFFFFF00UL)
#define RDC_SAMPLE_RISE_I_VALUE_SHIFT (8U)
#define RDC_SAMPLE_RISE_I_VALUE_GET(x) (((uint32_t)(x) & RDC_SAMPLE_RISE_I_VALUE_MASK) >> RDC_SAMPLE_RISE_I_VALUE_SHIFT)

/* Bitfield definition for register: SAMPLE_FALL_I */
/*
 * VALUE (RO)
 *
 * sample value on falling edge of rectify signal
 */
#define RDC_SAMPLE_FALL_I_VALUE_MASK (0xFFFFFF00UL)
#define RDC_SAMPLE_FALL_I_VALUE_SHIFT (8U)
#define RDC_SAMPLE_FALL_I_VALUE_GET(x) (((uint32_t)(x) & RDC_SAMPLE_FALL_I_VALUE_MASK) >> RDC_SAMPLE_FALL_I_VALUE_SHIFT)

/* Bitfield definition for register: ACC_CNT_I */
/*
 * CNT_NEG (RO)
 *
 * sample number during the negtive of rectify signal
 * 1: 1
 * 2: 2
 * …
 */
#define RDC_ACC_CNT_I_CNT_NEG_MASK (0xFFFF0000UL)
#define RDC_ACC_CNT_I_CNT_NEG_SHIFT (16U)
#define RDC_ACC_CNT_I_CNT_NEG_GET(x) (((uint32_t)(x) & RDC_ACC_CNT_I_CNT_NEG_MASK) >> RDC_ACC_CNT_I_CNT_NEG_SHIFT)

/*
 * CNT_POS (RO)
 *
 * sample number during the positive of rectify signal
 * 1: 1
 * 2: 2
 * …
 */
#define RDC_ACC_CNT_I_CNT_POS_MASK (0xFFFFU)
#define RDC_ACC_CNT_I_CNT_POS_SHIFT (0U)
#define RDC_ACC_CNT_I_CNT_POS_GET(x) (((uint32_t)(x) & RDC_ACC_CNT_I_CNT_POS_MASK) >> RDC_ACC_CNT_I_CNT_POS_SHIFT)

/* Bitfield definition for register: SIGN_CNT_I */
/*
 * CNT_NEG (RO)
 *
 * Positive sample counter during negative rectify signal
 */
#define RDC_SIGN_CNT_I_CNT_NEG_MASK (0xFFFF0000UL)
#define RDC_SIGN_CNT_I_CNT_NEG_SHIFT (16U)
#define RDC_SIGN_CNT_I_CNT_NEG_GET(x) (((uint32_t)(x) & RDC_SIGN_CNT_I_CNT_NEG_MASK) >> RDC_SIGN_CNT_I_CNT_NEG_SHIFT)

/*
 * CNT_POS (RO)
 *
 * Negative sample counter during positive rectify signal
 */
#define RDC_SIGN_CNT_I_CNT_POS_MASK (0xFFFFU)
#define RDC_SIGN_CNT_I_CNT_POS_SHIFT (0U)
#define RDC_SIGN_CNT_I_CNT_POS_GET(x) (((uint32_t)(x) & RDC_SIGN_CNT_I_CNT_POS_MASK) >> RDC_SIGN_CNT_I_CNT_POS_SHIFT)

/* Bitfield definition for register: SYNC_DELAY_Q */
/*
 * DELAY (RW)
 *
 * Delay  in clock cycle for synchronous signal, the value shoud less than half of exc_period.exc_period.
 * 0: invalid value
 * 1: 1 cycles
 * 2: 2 cycles
 * ...
 */
#define RDC_SYNC_DELAY_Q_DELAY_MASK (0xFFFFFFFFUL)
#define RDC_SYNC_DELAY_Q_DELAY_SHIFT (0U)
#define RDC_SYNC_DELAY_Q_DELAY_SET(x) (((uint32_t)(x) << RDC_SYNC_DELAY_Q_DELAY_SHIFT) & RDC_SYNC_DELAY_Q_DELAY_MASK)
#define RDC_SYNC_DELAY_Q_DELAY_GET(x) (((uint32_t)(x) & RDC_SYNC_DELAY_Q_DELAY_MASK) >> RDC_SYNC_DELAY_Q_DELAY_SHIFT)

/* Bitfield definition for register: RISE_DELAY_Q */
/*
 * RISE_DELAY (RO)
 *
 * Delay value on rising edge of  q_channel data
 * 0: 1 cycle
 * 1: 2 cycles
 * …
 */
#define RDC_RISE_DELAY_Q_RISE_DELAY_MASK (0xFFFFFFFFUL)
#define RDC_RISE_DELAY_Q_RISE_DELAY_SHIFT (0U)
#define RDC_RISE_DELAY_Q_RISE_DELAY_GET(x) (((uint32_t)(x) & RDC_RISE_DELAY_Q_RISE_DELAY_MASK) >> RDC_RISE_DELAY_Q_RISE_DELAY_SHIFT)

/* Bitfield definition for register: FALL_DELAY_Q */
/*
 * FALL_DELAY (RO)
 *
 * Delay value on falling edge of  q_channel data
 * 0: 1 cycle
 * 1: 2 cycles
 * …
 */
#define RDC_FALL_DELAY_Q_FALL_DELAY_MASK (0xFFFFFFFFUL)
#define RDC_FALL_DELAY_Q_FALL_DELAY_SHIFT (0U)
#define RDC_FALL_DELAY_Q_FALL_DELAY_GET(x) (((uint32_t)(x) & RDC_FALL_DELAY_Q_FALL_DELAY_MASK) >> RDC_FALL_DELAY_Q_FALL_DELAY_SHIFT)

/* Bitfield definition for register: SAMPLE_RISE_Q */
/*
 * VALUE (RO)
 *
 * sample value on rising edge of rectify signal
 */
#define RDC_SAMPLE_RISE_Q_VALUE_MASK (0xFFFFFF00UL)
#define RDC_SAMPLE_RISE_Q_VALUE_SHIFT (8U)
#define RDC_SAMPLE_RISE_Q_VALUE_GET(x) (((uint32_t)(x) & RDC_SAMPLE_RISE_Q_VALUE_MASK) >> RDC_SAMPLE_RISE_Q_VALUE_SHIFT)

/* Bitfield definition for register: SAMPLE_FALL_Q */
/*
 * VALUE (RO)
 *
 * sample value on falling edge of rectify signal
 */
#define RDC_SAMPLE_FALL_Q_VALUE_MASK (0xFFFFFF00UL)
#define RDC_SAMPLE_FALL_Q_VALUE_SHIFT (8U)
#define RDC_SAMPLE_FALL_Q_VALUE_GET(x) (((uint32_t)(x) & RDC_SAMPLE_FALL_Q_VALUE_MASK) >> RDC_SAMPLE_FALL_Q_VALUE_SHIFT)

/* Bitfield definition for register: ACC_CNT_Q */
/*
 * CNT_NEG (RO)
 *
 * sample number during the negtive of rectify signal
 * 1: 1
 * 2: 2
 * …
 */
#define RDC_ACC_CNT_Q_CNT_NEG_MASK (0xFFFF0000UL)
#define RDC_ACC_CNT_Q_CNT_NEG_SHIFT (16U)
#define RDC_ACC_CNT_Q_CNT_NEG_GET(x) (((uint32_t)(x) & RDC_ACC_CNT_Q_CNT_NEG_MASK) >> RDC_ACC_CNT_Q_CNT_NEG_SHIFT)

